import streamlit as st

import numpy as np
from sklearn.metrics.pairwise import cosine_similarity

universities = {
    '武蔵野大学': [0.25, 0.8, 0.4, 0.8333333333, 0.25, 0.1428571429, 0.1049685094, 0.8333333333, 0.3333333333, 0.6666666667, 0.6666666667, 0.75, 0.1221381278, 0.6842105263, 0.0119142705, 0.4864864865, 0.8],
    '日本大学': [1, 0.8, 0.2, 0.5,	0.25,	0.4285714286,	0.3414975507,	0.6666666667,	0,	0,	0.9166666667,	0,	0.03230644377,	0.05263157895,	1,	0.1351351351,	0.2],
    '東洋大学': [0.2,	0.6,	0.4,	0.5	,0,	0.1428571429,	0.2925122463,	0.5,	0,	0,	1,	0.25,	0.08071695172,	0.4736842105,	0.3607394835,	1,	0],
    '駒澤大学': [0.25,	0.8,	0.8,	1,	0.5,	0.2857142857,	0,	0.6666666667,	0.3333333333,	0,	0.1666666667,	0.25,	0.08689294703,	1,	0.08514709798,	0.8108108108,	0.2],
    '専修大学': [0.25, 0.8, 0.6, 0.3333333333, 0.75, 0,	0, 0, 1, 0,	0.25, 0, 0,	0.2631578947, 0.1371805112, 0.2972972973, 40.8],
    '青山学院大学': [1,	1,	0.2,	0.5	,0,	0.5714285714,	0.5150454864,	1,	1,	0.6666666667,	0.5,	1,	0.2825638514,	1,	0.185153754,	0.3243243243,	1],
    '中央大学': [0.75,	0.8,	1,	0.5,	0.25,	0.4285714286,	0.4023792862,	0.6666666667,	0,	0.3333333333,	0.25,	0,	0.9232246024,	0.2631578947,	0.3036974175,	0.2432432432,	0],
    '明治大学': [0,	0.8,	0.6,	0.8333333333,	0.25,	0.5714285714,	0.522743177,	0,	0,	0.6666666667,	0.4166666667,	0.75,	0.06205489933,	0.2631578947,	0.4120240948,	0.4594594595,	0.2],
    '立教大学': [0.75,	0.6,	0.8,	0.6666666667,	0.25,	0.4285714286,	0.5066480056,	0.8333333333,	0.6666666667,	1,	0.5833333333,	1,	0.01443091466,	0.6842105263,	0.1840222311,	0.1351351351,	0.6],
    '法政大学': [0.25,	0.8,	0.6,	0.1666666667,	0.5,	0.2857142857,	0.4121763471,	0.6666666667,	0,	0.6666666667,	0.8333333333,	0.5,	0.04782061549,	1,	0.3287573216,	0.2162162162,	0.8],
    '学習院大学': [0.5,	0.6,	0.2,	0.6666666667,	0,	0,	0.4289713086,	0.1666666667,	1,	0.3333333333,	0,	0.25,	0.3101618808,	0,	0,	0.5135135135,	0.8],
    '東京大学': [0.5,	0,	0.8,	0.8333333333,	0.25,	1,	1,	0.3333333333,	0.3333333333,	0,	0.08333333333,	1,	1,	0.05263157895,	0.3157780884,	0,	0.4],
    '早稲田大学': [0.75,	0.8,	0,	0,	1,	1,	0.6312106368,	0.8333333333,	1,	0.6666666667,	0.6666666667,	0.75,	0.2194113946,	0.4736842105,	0.6079106763,	0.7297297297,	0.2],
    '慶應大学': [1,	1,	0.8,	0.8333333333,	0.25,	1,	0.7326801959,	0.8333333333,	1,	1,	0.4166666667,	0.75,	0.228937264,	0.6842105263,	0.4026890309,	0.6486486486,	0.2],
    '上智大学': [0.75,	0.8,	1,	0.8333333333,	0.25,	0.8571428571,	0.5262421274,	0.3333333333,	0.6666666667,	1,	0.3333333333,	0.5,	0.08179484613,	0.05263157895,	0.07223442492,	0.02702702703,	0.4],
    '東京理科大学': [0.25,	1,	0.6,	0.1666666667,	0.25,	0.2857142857,	0.5626312106,	0.8333333333,	0.3333333333,	0.6666666667,	0.1666666667,	0.5,	0.02958757579,	0.4736842105,	0.1693124334,	0,	0.6],
}

_sample_dict = {}

st.title("理想の大学診断")
st.write("以下の質問に答えてください。")

st.write("①大学選択において恋愛を充実させたい。")
pick_1 = st.radio('pick_1',['当てはまる','どちらかと言えば当てはまる','どちらでもない','どちらかと言えば当てはまらない','当てはまらない'], label_visibility="hidden")
st.write("②大学選択において授業の充実度が大事だ。")
pick_2 = st.radio('pick_2',['当てはまる','どちらかと言えば当てはまる','どちらでもない','どちらかと言えば当てはまらない','当てはまらない'], label_visibility="hidden")
st.write("③大学選択において学食は美味しい方がいい。")
pick_3 = st.radio('pick_3',['当てはまる','どちらかと言えば当てはまる','どちらでもない','どちらかと言えば当てはまらない','当てはまらない'], label_visibility="hidden")
st.write("④大学選択において学食は安い方がいい。")
pick_4 = st.radio('pick_4',['当てはまる','どちらかと言えば当てはまる','どちらでもない','どちらかと言えば当てはまらない','当てはまらない'], label_visibility="hidden")
st.write("⑤大学選択において長期休みは充実させたい。")
pick_5 = st.radio('pick_5',['当てはまる','どちらかと言えば当てはまる','どちらでもない','どちらかと言えば当てはまらない','当てはまらない'], label_visibility="hidden")
st.write("⑥大学選択において知名度が大事だ。")
pick_6 = st.radio('pick_6',['当てはまる','どちらかと言えば当てはまる','どちらでもない','どちらかと言えば当てはまらない','当てはまらない'], label_visibility="hidden")
st.write("⑦大学選択においてバイト収入は大事だ。")
pick_7 = st.radio('pick_7',['当てはまる','どちらかと言えば当てはまる','どちらでもない','どちらかと言えば当てはまらない','当てはまらない'], label_visibility="hidden")
st.write("⑧大学選択において先輩との交流が多い方がいい。")
pick_8 = st.radio('pick_8',['当てはまる','どちらかと言えば当てはまる','どちらでもない','どちらかと言えば当てはまらない','当てはまらない'], label_visibility="hidden")
st.write("⑨大学選択において周囲の金銭感覚が高い方がいい。")
pick_9 = st.radio('pick_9',['当てはまる','どちらかと言えば当てはまる','どちらでもない','どちらかと言えば当てはまらない','当てはまらない'], label_visibility="hidden")
st.write("⑩大学選択において課題の量が少ない方がいい。(テストあり)")
pick_10 = st.radio('pick_10',['当てはまる','どちらかと言えば当てはまる','どちらでもない','どちらかと言えば当てはまらない','当てはまらない'], label_visibility="hidden")
st.write("⑪大学選択において学部数が多い方がいい。")
pick_11 = st.radio('pick_11',['当てはまる','どちらかと言えば当てはまる','どちらでもない','どちらかと言えば当てはまらない','当てはまらない'], label_visibility="hidden")
st.write("⑫大学選択においてキャンパスが充実している方がいい。")
pick_12 = st.radio('pick_12',['当てはまる','どちらかと言えば当てはまる','どちらでもない','どちらかと言えば当てはまらない','当てはまらない'], label_visibility="hidden")
st.write("⑬大学選択においてキャンパスが大きい方がいい。")
pick_13 = st.radio('pick_13',['当てはまる','どちらかと言えば当てはまる','どちらでもない','どちらかと言えば当てはまらない','当てはまらない'], label_visibility="hidden")
st.write("⑭大学選択においてキャンパスの立地が大事だ。")
pick_14 = st.radio('pick_14',['当てはまる','どちらかと言えば当てはまる','どちらでもない','どちらかと言えば当てはまらない','当てはまらない'], label_visibility="hidden")
st.write("⑮大学選択において生徒数が多い方がいい。")
pick_15 = st.radio('pick_15',['当てはまる','どちらかと言えば当てはまる','どちらでもない','どちらかと言えば当てはまらない','当てはまらない'], label_visibility="hidden")
st.write("⑯大学選択において周辺に娯楽施設があってほしい。")
pick_16 = st.radio('pick_16',['当てはまる','どちらかと言えば当てはまる','どちらでもない','どちらかと言えば当てはまらない','当てはまらない'], label_visibility="hidden")
st.write("⑰大学選択において見た目の清潔さが大事だと思う。")
pick_17 = st.radio('pick_17',['当てはまる','どちらかと言えば当てはまる','どちらでもない','どちらかと言えば当てはまらない','当てはまらない'], label_visibility="hidden")

answer_dict = {'当てはまらない': 0, 'どちらかと言えば当てはまらない': 0.25, 'どちらでもない': 0.5, 'どちらかと言えば当てはまる': 0.75, '当てはまる': 1}

answer_list = [answer_dict.get(pick_1), answer_dict.get(pick_2), answer_dict.get(pick_3), answer_dict.get(pick_4), answer_dict.get(pick_5), answer_dict.get(pick_6), answer_dict.get(pick_7), answer_dict.get(pick_8), answer_dict.get(pick_9), answer_dict.get(pick_10), answer_dict.get(pick_11), answer_dict.get(pick_12), answer_dict.get(pick_13), answer_dict.get(pick_14), answer_dict.get(pick_15), answer_dict.get(pick_16), answer_dict.get(pick_17)]

similarities = {}
for university, features in universities.items():
    similarity = cosine_similarity([answer_list], [features])[0][0]
    similarities[university] = similarity

if st.button('Click me') == True:
    sorted_universities = sorted(similarities.items(), key=lambda x: x[1], reverse=True)
    for university, similarity in sorted_universities:
        print(f"{university}: {similarity}")
